Tekla.Structures.Drawing.Symbol
The Symbol class defines a drawing object that is displayed as a symbol in a drawing.
Symbols are located in the environment directory under the folder named "symbols"
in .sym files that can contain up to 255 symbols.
Symbol files can be created with SymEd. See the Tekla Structures help for more information.
using Tekla.Structures.Drawing;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
DrawingHandler MyDrawingHandler = new DrawingHandler();
ViewBase view = MyDrawingHandler.GetActiveDrawing().GetSheet().GetAllViews().Current as ViewBase;
Symbol xs = new Symbol(view, new Point(1000, 2000), new SymbolInfo("xsteel", 52));
xs.Attributes.Angle = 30;
xs.Attributes.Frame.Type = FrameTypes.Rectangular;
xs.Attributes.Height = 4.0;
xs.Insert();
}
}

Tekla.Structures.Drawing.Symbol.Attributes
Gets or sets the symbol attributes.

Tekla.Structures.Drawing.Symbol.InsertionPoint
Gets or sets the symbol insertion point.

Tekla.Structures.Drawing.Symbol.SymbolInfo
Gets or sets the symbol information.

Tekla.Structures.Drawing.Symbol.Placing
The current placing of the object.
See the placing types for different placing options.

Tekla.Structures.Drawing.Symbol.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point)
Creates a new symbol instance using the default symbol information and standard attributes.
View: The view where to insert the symbol.
InsertionPoint: The location where to place the symbol.

Tekla.Structures.Drawing.Symbol.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.PlacingBase)
Creates a new symbol instance using the default symbol information, standard attributes and the given placing.
View: The view where to insert the symbol.
InsertionPoint: The location where to place the symbol.
Placing: The way the object is placed.

Tekla.Structures.Drawing.Symbol.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.SymbolInfo)
Creates a new symbol instance using standard attributes.
View: The view where to insert the symbol.
InsertionPoint: The location where to place the symbol.
SymbolInfo: The symbol information to be used.

Tekla.Structures.Drawing.Symbol.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.SymbolInfo,Tekla.Structures.Drawing.PlacingBase)
Creates a new symbol instance using standard attributes.
View: The view where to insert the symbol.
InsertionPoint: The location where to place the symbol.
SymbolInfo: The symbol information to be used.
Placing: The way the object is placed.

Tekla.Structures.Drawing.Symbol.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.SymbolInfo,Tekla.Structures.Drawing.Symbol.SymbolAttributes)
Creates a new symbol instance using the given attributes.
View: The view where to insert the symbol.
InsertionPoint: The location where to place the symbol.
SymbolInfo: The symbol information to be used.
Attributes: The symbol attributes to be applied.

Tekla.Structures.Drawing.Symbol.#ctor(Tekla.Structures.Drawing.ViewBase,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Drawing.SymbolInfo,Tekla.Structures.Drawing.Symbol.SymbolAttributes,Tekla.Structures.Drawing.PlacingBase)
Creates a new symbol instance using the given attributes and placing.
View: The view where to insert the symbol.
InsertionPoint: The location where to place the symbol.
SymbolInfo: The symbol information to be used.
Attributes: The symbol attributes to be applied.
Placing: The way the object is placed.

Tekla.Structures.Drawing.Symbol.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.Symbol.Insert
Inserts the symbol into the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Symbol.Select
Selects the symbol from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Symbol.Modify
Modifies the symbol in the current drawing database.
Throws Tekla.Structures.Drawing.InvalidAttributesForOperationException: Thrown if Attributes contains values that are not supported by the object.
Returns: True on success.

Tekla.Structures.Drawing.Symbol.Delete
Deletes the symbol from the current drawing database.
Returns: True on success.

Tekla.Structures.Drawing.Symbol.GetObjectAlignedBoundingBox
Returns the bounding box of the symbol (rectangle format).
Returns: The bounding box of the symbol.

Tekla.Structures.Drawing.Symbol.GetAxisAlignedBoundingBox
Returns the bounding box of the symbol (rectangle format).
Returns: The bounding box of the symbol.

Tekla.Structures.Drawing.Symbol.MoveObjectRelative(Tekla.Structures.Geometry3d.Vector)
Moves the object using the move vector.
MoveVector: The move vector to be used.
Returns: True.

Tekla.Structures.Drawing.Symbol.GetObjects
Gets the children objects of the current object.
Returns: The children objects of the current object.

Tekla.Structures.Drawing.Symbol.GetObjects(System.Type[])
Gets the children objects of the current object that are of certain types.
TypeFilter: The types of the objects to get.
Returns: The children objects of the current object that are of certain types.

Tekla.Structures.Drawing.Symbol.Hideable
Accesses the information if this object is hidden or not or if it should be.